# install packages
tap 'homebrew/cask-fonts'
tap 'homebrew/services'
tap 'buo/cask-upgrade'
brew 'mas'

# brew install
brew 'wget'
brew 'stow'
brew 'pyenv'
brew 'gh'
brew 'git'
brew 'tree'
brew 'jq'
brew 'tldr'
brew 'coreutils'
brew 'gawk'
brew 'gsed'
brew 'gnu-getopt'
brew 'grep'

# SHELL
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'fzf'

# NVIM
brew 'neovim'
brew 'tmux'
brew 'lazygit'

# containers
brew 'argo'
brew 'kubectl'
brew 'vmware-tanzu/kpack-cli'
brew 'kp'

# casks
# cask 'firefox'
cask 'hammerspoon'
cask 'raycast'  # spotlight replacement
cask 'obsidian'
cask 'ghostty'  # terminal emulator
cask 'insomnia'  

# fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono'

# vscode -- install-extension

